42crunch.vscode-openapi
adpyke.vscode-sql-formatter
alefragnani.bookmarks
alefragnani.project-manager
alexkrechik.cucumberautocomplete
amiralizadeh9480.laravel-extra-intellisense
anthropic.claude-code
anysphere.cursorpyright
anysphere.pyright
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bradgashler.htmltagwrap
bufbuild.vscode-buf
codingyu.laravel-goto-view
craigmaslowski.erb
damms005.devdb
dariofuzinato.vue-peek
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
glitchbl.laravel-create-view
golang.go
gruntfuggly.todo-tree
hashicorp.terraform
hbenl.vscode-test-explorer
hediet.vscode-drawio
ihunte.laravel-blade-wrapper
jebbs.plantuml
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
mosapride.zenkaku
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.autopep8
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
naoray.laravel-goto-components
oderwat.indent-rainbow
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
openai.chatgpt
pflannery.vscode-versionlens
pgl.laravel-jump-controller
recca0120.vscode-phpunit
redhat.vscode-yaml
ryannaddy.laravel-artisan
shopify.ruby-lsp
shufo.vscode-blade-formatter
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
whtouche.vscode-js-console-utils
wmaurer.change-case
xdebug.php-debug
