tap "bufbuild/buf"
tap "dagger/tap"
tap "homebrew/cask-fonts"
brew "anyenv"
brew "atlas"
brew "cloud-sql-proxy"
brew "direnv"
brew "ffmpeg"
brew "fontforge", link: false
brew "gh"
brew "go"
brew "go@1.22"
brew "gogcli"
brew "grep"
brew "icu4c@76"
brew "libyaml"
brew "mise"
brew "mysql"
brew "neovim"
brew "openjdk"
brew "pipx"
brew "postgresql@14", restart_service: :changed
brew "terminal-notifier"
brew "tree"
brew "bufbuild/buf/buf"
cask "1password"
cask "alt-tab"
cask "android-platform-tools"
cask "ankerwork"
cask "aqua-voice"
cask "audacity"
cask "claude"
cask "dagger/tap/container-use"
cask "cursor"
cask "disk-drill"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "figma"
cask "font-ricty-diminished"
cask "fontforge-app"
cask "google-chrome"
cask "iterm2"
cask "kobo"
cask "logi-options+"
cask "notion"
cask "pgadmin4"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "sourcetree"
cask "thunderbird"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wezterm"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexkrechik.cucumberautocomplete"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradgashler.htmltagwrap"
vscode "bufbuild.vscode-buf"
vscode "codingyu.laravel-goto-view"
vscode "craigmaslowski.erb"
vscode "damms005.devdb"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "ihunte.laravel-blade-wrapper"
vscode "jebbs.plantuml"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "naoray.laravel-goto-components"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "pflannery.vscode-versionlens"
vscode "pgl.laravel-jump-controller"
vscode "recca0120.vscode-phpunit"
vscode "redhat.vscode-yaml"
vscode "ryannaddy.laravel-artisan"
vscode "shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "vscode-icons-team.vscode-icons"
vscode "whtouche.vscode-js-console-utils"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/matryer/moq"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/google/wire/cmd/wire"
